{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Future Continuous",
    "1": "Future Perfect",
    "2": "Future Perfect Continuous",
    "3": "Future Simple",
    "4": "Past Continuous",
    "5": "Past Perfect",
    "6": "Past Perfect Continuous",
    "7": "Past Simple",
    "8": "Present Continuous",
    "9": "Present Perfect",
    "10": "Present Perfect Continuous",
    "11": "Present Simple"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Future Continuous": 0,
    "Future Perfect": 1,
    "Future Perfect Continuous": 2,
    "Future Simple": 3,
    "Past Continuous": 4,
    "Past Perfect": 5,
    "Past Perfect Continuous": 6,
    "Past Simple": 7,
    "Present Continuous": 8,
    "Present Perfect": 9,
    "Present Perfect Continuous": 10,
    "Present Simple": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.47.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
